

faz_choice=[('تک فاز','تک فاز'),('سه فاز','سه فاز')]

volt_choice=[('400 ولت','400 ولت'),('230 ولت','230 ولت'),('220 ولت','220 ولت')]

# diametr_choice=[('1.2 اینچ','1.2 اینچ'),('3.4 اینچ','3.4 اینچ'),(),(),(),(),(),(),()]
keshvar_sazande_choice=[('ایران','ایران'),('چین','چین'),('ایتالیا','ایتالیا'),('قطعات ایتالیایی مونتاژ ایران','قطعات ایتالیایی مونتاژ ایران'),]


jense_parvane_choice=[('المینیوم','المینیوم'),('استیل 304','استیل 304'),('استیل 316','استیل 316'),('برنجی','برنجی'),('برنز /استیل','برنز /استیل'),('تکنو پلیمر','تکنو پلیمر'),('چدن','چدن'),('فایبر گلس','فایبر گلس'),('نوریل','نوریل')]

jense_badane_choice=[('المینیوم','المینیوم'),('استیل 304','استیل 304'),('استیل 316','استیل 316'),('چدن','چدن'),('پلاستیک','پلاستیک')]

jense_shaft_choice=[('المینیوم','المینیوم'),('استیل 304','استیل 304'),('استیل 303','استیل 303'),('استیل 316','استیل 316'),('کربن استیل','کربن استیل')]

jense_ababand_choice=[('گرافیت سرامیکی','گرافیت سرامیکی'),('مکانیکال سیل','مکانیکال سیل'),('سیلیکون کاربید گرافیت','سیلیکون کاربید گرافیت'),('مکانیکال سیل با ساختار سرامیک','مکانیکال سیل با ساختار سرامیک'),]

jense_vaset_choice=[('المینیوم','المینیوم'),('استیل 304','استیل 304'),('چدن','چدن'),('چدن و المینیوم','چدن و المینیوم')]

jense_simpich_choice=[('چدن','چدن'),('مس','مس')]

jese_poste_va_paye_choice=[('المینیوم','المینیوم'),('چدن و المینیوم','چدن و المینیوم'),('چدن','چدن')]

kase_seyl_choice=[('استیل 304','استیل 304'),('چدن','چدن'),('چدن و استیل 304','چدن و استیل 304')]

daraje_hefazati_motor_choice=[('IP55','IP55'),('IP44','IP44')]                              


yataghan_choice=[('بلبرینگ دو رو بسته','بلبرینگ دو رو بسته'),('بلبرینگ دو رو بسته با گریس داءمی','بلبرینگ دو رو بسته با گریس داءمی')]

khazen_choice=[('نوکار','نوکار'),]


# ('',home)